//go:build OMIT
// +build OMIT

package main

import "fmt"

type I interface {
	M()
}

type T struct {
	S string
}

<<<<<<< HEAD
// Наявність метода M() означає, що даний тип T реалізовує інтерфейс I;
// зауважте, що ніяким чином не потрібно ЯВНО вказувати, що тип T реалізує конкретний інтерфейс I.
=======

// Додаючи функцію-метод M() до структурного типу даних T означає,
// що даний тип реалізовує інтерфейс I; зауважте, що ніяким чином
// не потрібно ЯВНО вказувати, що тип T реалізує конкретний інтерфейс I.

>>>>>>> c00883de89fe4ae0840173dc8f913ce8f199dc81
func (t T) M() {
	fmt.Println(t.S)
}

func main() {
	var i I = T{"вітаю"}
	i.M()
}
